// RANKA トーク辞書：実行処理エージェント
(function(){
//=============================================================



//-------------------------------------------------------------
// 会話コマンド
//-------------------------------------------------------------
// トークを１行処理
var talk = function(text){


};

// チェイン（継続）
var yield = function(){


};

// 送信（raw会話データの発行）
var send = function(talk){


};


// ジャンプ（飛んで戻ってこない）
var jump = function(pos){


};

// 呼び出し（飛んで戻ってくる）
var call = function(pos){


};


//=============================================================
})();
